<h3><b>Introduction to Data Analytics - Exercise set 2 - pandas-module</b></h3>

Put all your exercises (Jupyter Notebooks or Python-files) in your course Git-project.
Use either code comments or Jupyter Notebook markdown (text) to document which exercise you are doing and what a certain code section does! 
You can return all of these exercises in a single Jupyter Notebook, if you wish.

<b>The datasets for these exercises have been collected from kaggle.com<br />
(a service providing different datasets for practice)</b>

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_2/es2_1.png" />

<h4><b>1. import pandas and read the csv-file found in Moodle (loans.csv). Use Python coding with pandas to answer the questions.</b></h4>

In [52]:
# Importing pandas and csv file
import pandas as pd
file = 'loans.csv'
df = pd.read_csv(file)

# Also let's get rid of whitespaces and change them to underscores
df.columns = df.columns.str.replace(" ", "_")

<li>Remove the Customer ID –column from data</li>
<li>Print the head of the data</li>

In [53]:
# Remove the column
df.drop('Customer_ID', axis=1, inplace=True)

In [54]:
# Print head
df.head()

,Loan_ID,Loan_Status,Current_Loan_Amount,Term,Credit_Score,Annual_Income,Years_in_current_job,Home_Ownership,Purpose,Monthly_Debt,Years_of_Credit_History,Months_since_last_delinquent,Number_of_Open_Accounts,Number_of_Credit_Problems,Current_Credit_Balance,Maximum_Open_Credit,Bankruptcies,Tax_Liens
0,14dd8831-6af5-400b-83ec-68e61888a048,Fully Paid,445412.0,Short Term,709.0,1167493.0,8 years,Home Mortgage,Home Improvements,5214.7,17.2,NaN,6.0,1.0,228190.0,416746.0,1.0,0.0
1,4771cc26-131a-45db-b5aa-537ea4ba5342,Fully Paid,262328.0,Short Term,NaN,NaN,10+ years,Home Mortgage,Debt Consolidation,33296.0,21.1,8.0,35.0,0.0,229976.0,850784.0,0.0,0.0
2,4eed4e6a-aa2f-4c91-8651-ce984ee8fb26,Fully Paid,99999999.0,Short Term,741.0,2231892.0,8 years,Own Home,Debt Consolidation,29200.5,14.9,29.0,18.0,1.0,297996.0,750090.0,0.0,0.0
3,77598f7b-32e7-4e3b-a6e5-06ba0d98fe8a,Fully Paid,347666.0,Long Term,721.0,806949.0,3 years,Own Home,Debt Consolidation,8741.9,12.0,NaN,9.0,0.0,256329.0,386958.0,0.0,0.0
4,d4062e70-befa-4995-8643-a0de73938182,Fully Paid,176220.0,Short Term,NaN,NaN,5 years,Rent,Debt Consolidation,20639.7,6.1,NaN,15.0,0.0,253460.0,427174.0,0.0,0.0

<li>Remove rows from the data that have <b style="color: red;">a too large of a loan</b> (Current Loan Amount should be less than 99999999)</li>

In [55]:
# remove loans that are too large
df = df[df['Current_Loan_Amount'] < 99999999]

<ul>
    <li>Remove rows that have the annual income as NaN (not a number)</li>
    <ul>
        <li><b>Extra task:</b> use imputation to use average income as the value instead of NaN</li>
    </ul>
</ul>

In [56]:
# remove rows if annual income is NaN
#Let's find out how many NaN values we have first
print(f"NaN values before - {df['Annual_Income'].isnull().sum()}")

# Then find out what's the average income
average_income = df['Annual_Income'].mean()
print(f"Average annual income is around {round(average_income)}")

# And fill it in with fillna() method.
df['Annual_Income'].fillna(average_income, inplace=True)

print(f"NaN values after - {df['Annual_Income'].isnull().sum()}")

NaN values before - 19154
Average annual income is around 1373246
NaN values after - 0

<li>Get the average Current Loan Amount</li>

In [57]:
# Get the average current loan using mean() method.
avg_loan = df['Current_Loan_Amount'].mean()
print(round(avg_loan))

312314

<li>Get the highest and lowest Annual Income in the dataset</li>

In [58]:
# get highest and lowest annual income in dataset
highest_income = df['Annual_Income'].max()
lowest_income = df['Annual_Income'].min()
print(f"Highest annual income - {highest_income}\n"
      f"Lowest annual income - {lowest_income}")

Highest annual income - 165557393.0
Lowest annual income - 76627.0

<li>Get the Home Ownership value of the <b>Loan ID = bbf87a87-22cd-4d10-bd9b-7a9cc1b6e59d</b></li>

In [59]:
# get the needed value with the Loan ID

df['Home_Ownership'][df['Loan_ID'] == "bbf87a87-22cd-4d10-bd9b-7a9cc1b6e59d"]

491    Own Home
Name: Home_Ownership, dtype: object

<li>Get the Actual Annual Income of the loan with the <b>ID = 76fa89b9-e6a8-49af-afa1-8151315aba8e</b></li>
<br><b>Note:</b> The Actual Annual Income should be :
<b style="color: green">Annual Income – 12 * Monthly Debt</b><br><br>
<b>Tip:</b> Create a new field with the above instruction to the DataFrame.

In [60]:
# create a new field for Actual Annual income (annual income - 12 * monthly debt)
df['Actuall_Annual_Income'] = df['Annual_Income'] - df['Monthly_Debt'] * 12
# get the Actual Annual income for the needed ID
df['Actuall_Annual_Income'][df['Loan_ID'] == "76fa89b9-e6a8-49af-afa1-8151315aba8e"]

# Seems like we have duplicated row here

109    674234.8
2216   674234.8
Name: Actuall_Annual_Income, dtype: float64

<li>Get the Loan ID of the loan with the smallest Actual Annual Income </li>

In [61]:
# get loan ID of lowest actual annual income
lowest_actual_income = df['Actuall_Annual_Income'].min()
df['Loan_ID'][df['Actuall_Annual_Income'] == lowest_actual_income]

11648    0a84b8ab-ed2f-474f-a3a9-8bf5bb90c31a
Name: Loan_ID, dtype: object

<li>How many loans are "Long term"?</li>

In [62]:
# produce code that shows many loans are long term
print(len(df[df['Term'] == 'Long Term']))

25475

<li>How many loaners have more than 1 bankruptcy?</li>

In [63]:
# produce code that shows how many loaners have more than 1 bankruptcy
print(len(df[df['Bankruptcies'] > 1]))

476

<li>How many Short Term loans are for Home Improvements?</li>

In [64]:
# produce code that shows how many of the Short Term loans are for Home Improvements
print(len(df[(df['Term'] == "Short Term") & (df['Purpose'] == "Home Improvements")]))

# and operator didn't work in this case. Googling for the solution ended up here:
# The or and and Python statements require truth-values. 
# For pandas, these are considered ambiguous, 
# so you should use "bitwise" | (or) or & (and) operations:

3490

<li>How many unique loan purposes are there?</li>

In [65]:
# produce code that shows how many unique loan purposes there are
print(len(df.groupby('Purpose')))

16

In [66]:
# Or using unique() method
df['Purpose'].unique()

array(['Home Improvements', 'Debt Consolidation', 'Buy House', 'other',
       'Buy a Car', 'major_purchase', 'Take a Trip', 'Other',
       'Business Loan', 'small_business', 'Medical Bills', 'vacation',
       'Educational Expenses', 'wedding', 'moving', 'renewable_energy'],
      dtype=object)

<li>What are the 3 most common loan purposes?</li>

In [67]:
# produce code that shows the 3 most common loan purposes
# Firstly data is grouped by purpose, then counted and sorted.
df.groupby('Purpose').count().sort_values('Loan_ID', ascending=False)[:3]

,Loan_ID,Loan_Status,Current_Loan_Amount,Term,Credit_Score,Annual_Income,Years_in_current_job,Home_Ownership,Monthly_Debt,Years_of_Credit_History,Months_since_last_delinquent,Number_of_Open_Accounts,Number_of_Credit_Problems,Current_Credit_Balance,Maximum_Open_Credit,Bankruptcies,Tax_Liens,Actuall_Annual_Income
Purpose,,,,,,,,,,,,,,,,,,
Debt Consolidation,69506,69506,69506,69506,54268,69506,66670,69506,69506,69506,32334,69506,69506,69506,69504,69401,69500,69506
other,5409,5409,5409,5409,4389,5409,5094,5409,5409,5409,2662,5409,5409,5409,5409,5384,5408,5409
Home Improvements,5124,5124,5124,5124,4005,5124,4846,5124,5124,5124,2767,5124,5124,5124,5124,5117,5123,5124

<li>Is there a correlation between <b>Annual Income</b> and <b>Number of Open Accounts</b> or is there a correlation between <b>Number of Credit Problems</b> and <b>Bankruptcies</b>?</li>

In [68]:
# produce code that shows which correlation statement is true
# The correlation here is quite weak
df['Annual_Income'].corr(df['Number_of_Open_Accounts'])

0.12705769402525527

<h4><b>2. Download the purchases.csv from Moodle, and do the following observations:</b></h4>

In [69]:
# Loading data set
df2 = pd.read_csv('purchases.csv')
# Removing white spaces from column names
df2.columns = df2.columns.str.replace(" ", "_")

<li>What was the total price sum of the Purchase Order Number 018H2015? (14 rows in total)</li>

In [70]:
# produce the code that gets the needed total price sum
df2[df2["Purchase_Order_Number"] == "018H2015"]['Total_Price'].sum()

1245.0400000000002

<li>What is the name and description of the purchased item with the Purchase Order Number 3176273?</li>

In [71]:
# produce the code that gets the needed name and description
df2[df2['Purchase_Order_Number'] == '3176273'][['Item_Name', 'Item_Description']]

      Item_Name Item_Description
103  PC Desktop   HP Prodesk 600

<li>How many occasions (rows) of purchase data happened during the year 2013?</li>

In [72]:
# produce the code that filters the needed data for year 2013

# Let's transfer data type of Purchase_Date from string to datetime type. 
# There are some impossible values such as year 2510 in the dataset, that's why errors='coerce' is used.
# Basically it replaces impossible values with NaN.
df2['Purchase_Date'] = pd.to_datetime(df2['Purchase_Date'], format='%m/%d/%Y', errors='coerce')
# Then let's create new Year column
df2['Year'] = df2['Purchase_Date'].dt.year
# And let's find how many ocassions there are
len(df2[df2['Year'] == 2013])

34024

<ul><li>What are the 5 most common Departments in the data?</li>
<ul><li><b>Extra task: </b>What are 3 Departments using most money in the data?</li></ul>
</ul>

In [73]:
# produce the code that gtest the needed most common departments

# value_counts() returns counts of unique values
# nlargest(n) returns the first n rows ordered by columns in desc order
df2['Department_Name'].value_counts().nlargest(5)

Corrections and Rehabilitation, Department of    10891
Correctional Health Care Services                 6593
Water Resources, Department of                    4582
Forestry and Fire Protection, Department of       4526
State Hospitals, Department of                    4281
Name: Department_Name, dtype: int64

In [74]:
df2.groupby('Department_Name').sum('Total_Price').nlargest(3,'Total_Price')['Total_Price'].astype('int64')

Department_Name
Health Care Services, Department of    21866849702
Public Health, Department of            2748240333
Social Services, Department of          1291192293
Name: Total_Price, dtype: int64

<li>Sort the data by Department Name</li>

In [75]:
# sort the data by department name
df2.sort_values('Department_Name')

,Creation_Date,Purchase_Date,Fiscal_Year,LPA_Number,Purchase_Order_Number,Requisition_Number,Acquisition_Type,Acquisition_Method,Department_Name,Supplier_Code,...,Normalized_UNSPSC,Commodity_Title,Class,Class_Title,Family,Family_Title,Segment,Segment_Title,Location,Year
6,11/30/2012,2012-06-15,2012-2013,NaN,11OAL07,NaN,NON-IT Goods,NCB,"Administrative Law, Office of",1001493.0,...,55101524.0,Reference books,55101500.0,Printed publications,55100000.0,Printed media,55000000.0,Published Products,"95833\n(38.615723, -121.50562)",2012.0
519,11/30/2012,2012-06-15,2012-2013,NaN,11OAL09,NaN,NON-IT Goods,NCB,"Administrative Law, Office of",1657720.0,...,55101524.0,Reference books,55101500.0,Printed publications,55100000.0,Printed media,55000000.0,Published Products,"55123\n(44.807169, -93.136157)",2012.0
20018,11/30/2012,2012-06-15,2012-2013,NaN,11OAL10,NaN,NON-IT Goods,NCB,"Administrative Law, Office of",1657720.0,...,55101524.0,Reference books,55101500.0,Printed publications,55100000.0,Printed media,55000000.0,Published Products,"55123\n(44.807169, -93.136157)",2012.0
31381,02/21/2013,2013-03-20,2012-2013,NaN,11-12201,NaN,NON-IT Services,Informal Competitive,"African American Museum, California",7341.0,...,82101801.0,Advertising campaign services,82101800.0,Advertising agency services,82100000.0,Advertising,82000000.0,Editorial and Design and Graphic and Fine Art ...,"90017\n(34.052895, -118.2642)",2013.0
27820,01/03/2013,2011-02-14,2012-2013,NaN,11-12175,NaN,NON-IT Services,Informal Competitive,"African American Museum, California",1749414.0,...,78141501.0,Freight forwarders services,78141500.0,Transport arranging services,78140000.0,Transport services,78000000.0,Transportation and Storage and Mail Services,NaN,2011.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
24826,12/17/2012,2012-12-15,2012-2013,NaN,4500192615,NaN,NON-IT Goods,Formal Competitive,"Water Resources, Department of",16299.0,...,27131603.0,Air regulators,27131600.0,Air fittings and connectors,27130000.0,Pneumatic machinery and equipment,27000000.0,Tools and General Machinery,"93390\n(35.373405, -119.018911)",2012.0
49068,06/13/2013,2013-06-12,2012-2013,NaN,4500199013,NaN,IT Goods,Informal Competitive,"Water Resources, Department of",1016373.0,...,43232605.0,Analytical or scientific software,43232600.0,Industry specific software,43230000.0,Software,43000000.0,Information Technology Broadcasting and Teleco...,1760\n,2013.0
49069,03/26/2014,2014-03-25,2013-2014,NaN,4500208992,NaN,NON-IT Goods,State Programs,"Water Resources, Department of",1743406.0,...,15101506.0,Gasoline or Petrol,15101500.0,Petroleum and distillates,15100000.0,Fuels,15000000.0,Fuels and Fuel Additives and Lubricants and An...,NaN,2014.0
49057,06/13/2013,2013-06-12,2012-2013,NaN,4500199013,NaN,IT Goods,Informal Competitive,"Water Resources, Department of",1016373.0,...,81112217.0,Industry specific software maintenance,81112200.0,Software maintenance and support,81110000.0,Computer services,81000000.0,Engineering and Research and Technology Based ...,1760\n,2013.0
44469,05/07/2013,2013-05-01,2012-2013,NaN,4500197248,NaN,NON-IT Goods,State Programs,"Water Resources, Department of",1743406.0,...,78180301.0,Fuelling of vehicles,78180300.0,Transport fuelling and vehicle storage and sup...,78180000.0,Transportation repair or maintenance services,78000000.0,Transportation and Storage and Mail Services,NaN,2013.0

<ul>
<li><b>Small extra tasks for extra points</b></li>
<ul>
<li>How many purchases in the data were IT Goods and had the total price more than 50000 dollars?</li>
<li>How many of the purchases have anything to do with IT? (IT Goods, IT Services, IT Telecommunications)</li>

</ul>
</ul>

In [76]:
# produce the code for the extra tasks if you wish complete them
it_goods = len(df2[(df2['Total_Price'] > 50000) & (df2['Acquisition_Type'] == 'IT Goods')])
it_total = len(df2[(df2['Acquisition_Type'] == 'IT Goods') | (df2['Acquisition_Type'] == 'IT Services') | (df2['Acquisition_Type'] == 'IT Telecommunications')])
print(f"IT Goods with more then 50000 dollars price: {it_goods}")
print(f"Totally purchases that have anything to do with IT: {it_total}")

IT Goods with more then 50000 dollars price: 698
Totally purchases that have anything to do with IT: 9558

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_2/es2_2.png" />

<h4><b>3. Download the data_salaries_india.csv from Moodle, and consider the following questions of the data. Use any means in pandas (or even NumPy) you wish to explain your answers.</b></h4>

<ul>
<li>Before we can do anything with the salaries, we have to convert them into something more usable</li>
<ul>
<li>Note: the salaries can be yearly, monthly or hourly salaries</li>
<ul>
<li>We don't also need the Indian rupee –sign (₹)</li>
</ul>
<li>You can use the template in Moodle to help you out with this (Salary filtering, pandas exercise 3)</li>
</ul>
</ul>

In [77]:

# helper function for pandas to convert all salaries
# into yearly integer salaries
def yearly_wage(row):
    # the last two characters determine if it's yearly, monthly, hourly
    period = row['Salary'][-2:]
    
    # remove all commas and combine all numbers
    number = int(''.join(filter(str.isdigit, row['Salary'])))
    
    # if it's hourly, the average work hours per year in India is
    # approximately 2117.01 (might change in future)
    if period == "hr":
        number = int(number * 2117.01)
    elif period == "mo":
        # months to year
        number = int(number * 12)
    
    # return the yearly salary in integer format
    return number

#changing scientific notation format
pd.set_option('display.float_format', lambda x: '%.1f' % x)

# Loading data set
df3 = pd.read_csv('data_salaries_india.csv')
# Removing white spaces from column names
df3.columns = df3.columns.str.replace(" ", "_")
# Converting salary data to yearly wage format
df3['Yearly_Salary'] = df3.apply(yearly_wage, axis=1)

<ul>
<li>What are the most common values in different fields (Job Titles, Companies, Location)? <b>Based on the distribution, is the data balanced or not?</b></li>
<ul>
<li><b>Extra task:</b> there seem to be some Job Titles that are almost the same, like "Machine Learning Data Associate" and "Machine Learning Associate", combine these into something common</li>
</ul>
</ul>

In [78]:
# produce the code that shows the most common values in different fields
# and answer the question about the distribution
# Let's combine common jobs together:
# 1. Obviously same titles with differences in names
df3['Job_Title'].replace('Data Science','Data Scientist', inplace=True)
df3['Job_Title'].replace('Data Science Lead','Lead Data Scientist', inplace=True)
df3['Job_Title'].replace('Data Science Manager','Data Scientist', inplace=True)
df3['Job_Title'].replace('Machine Learning Software Engineer','Machine Learning Engineer', inplace=True)
df3['Job_Title'].replace('Software Engineer - Machine Learning','Machine Learning Engineer', inplace=True)
df3['Job_Title'].replace('Machine Learning Data Analyst','Data Analyst', inplace=True)

In [79]:
# 2. There is role called Machine Learning Engineer/Data Scientist. Let's find out is it closer to engineer or to data scientist
both = df3[df3['Job_Title'] == 'Machine Learning Engineer/Data Scientist']['Yearly_Salary'].describe().astype('int64')
engineer = df3[df3['Job_Title'] == 'Machine Learning Engineer']['Yearly_Salary'].describe().astype('int64')
scientist = df3[df3['Job_Title'] == 'Data Scientist']['Yearly_Salary'].describe().astype('int64')
print(f"Compared with engineers:{both.compare(engineer)}\n Compared with scientist{both.compare(scientist)}")
# Seems like these guys would better fit into Data Scientist role, since their means are pretty close to each other

# Actually afterwards I realized that there are only 2 of them, so it doesn't realy matter. But anyways
df3['Job_Title'].replace('Machine Learning Engineer/Data Scientist','Data Analyst', inplace=True)

Compared with engineers:          self    other
count        2      687
mean   1575781  1050164
std    1270248  1193970
min     677580    21628
25%    1126680   362352
50%    1575781   709492
75%    2024882  1243222
max    2473983  9297256
 Compared with scientist          self     other
count        2      2220
mean   1575781   1478291
std    1270248   1740646
min     677580     50613
25%    1126680    600000
50%    1575781   1023673
75%    2024882   1687135
max    2473983  19234356

In [80]:
# 3. Let's take a look onto ML developers
df3[df3['Job_Title'] == 'Machine Learning Developer']['Yearly_Salary'].describe().astype('int64')
# Generally speaking software engineers and software developers are close to each other but still have some differences.
# In this case there are only 2 developers, and they fit into 50% segment of engineers quite smoothly, so let's join them as well.
df3['Job_Title'].replace('Machine Learning Developer','Machine Learning Engineer', inplace=True)

In [81]:
# 4. Let's also join all ML Associates into one category, since there are only few people in each category and their wage difference is not so big
df3['Job_Title'].replace({"Machine Learning Data Associate II": "Machine Learning Associate",
                          "Machine Learning Data Associate": "Machine Learning Associate",
                          "Machine Learning Data Associate I": "Machine Learning Associate",
                          "Associate Machine Learning Engineer": "Machine Learning Associate"}, inplace=True)

In [82]:
# Our final list of titles.
# In my opinion in that paticular case we could also join trainees, juniors and associates to the same category(ies), since there are only few of them.
# But I've decided to keep them in case if this dataset keeps growing and we could possibly get more data about those titles,
# which could be usefull in the future
df3.groupby(['Job_Title']).count()

,Company_Name,Role,Salaries_Reported,Location,Salary,Yearly_Salary
Job_Title,,,,,,
CEO,1,1,1,1,1,1
Data Analyst,1167,1170,1170,1170,1170,1170
Data Engineer,947,948,948,948,948,948
Data Science Associate,1,1,1,1,1,1
Data Science Consultant,1,1,1,1,1,1
Data Scientist,2220,2220,2220,2220,2220,2220
Data Scientist - Trainee,2,2,2,2,2,2
Junior Data Scientist,22,22,22,22,22,22
Lead Data Scientist,7,7,7,7,7,7
Machine Learning Associate,6,6,6,6,6,6
Machine Learning Consultant,2,2,2,2,2,2
Machine Learning Engineer,689,689,689,689,689,689
Machine Learning Scientist,2,2,2,2,2,2
National Director,1,1,1,1,1,1
Senior Data Scientist,45,45,45,45,45,45
Senior Machine Learning Engineer,10,10,10,10,10,10

<li>Are there any outliers in the data that might affect the averages negatively (certain salaries)? Manage the outliers as you best see fit (either remove them or leave them, based on your analysis) </li>

In [83]:
# produce the code that shows the potential outliers and take care of them as you see fit
# Let's get rid of few NaN values first.
df3.isna().sum()
# As we can see, there are 4 rows with missing company name. We could join them
# to the for example 'Other Companies' category. Or we could just delete these rows.
df3['Company_Name'].fillna('Other Companies', inplace=True)

In [84]:
# Since it is pretty hard to estimate salaries in rupees, let's convert it to USD.
# One rupee is aproximately 0.012 USD
df3['Yearly_Salary'] *= 0.012

In [85]:
# Now, let's take a close look on possible outliers
df3.groupby(['Job_Title'])['Yearly_Salary'].describe()

,count,mean,std,min,25%,50%,75%,max
Job_Title,,,,,,,,
CEO,1.0,893343.9,NaN,893343.9,893343.9,893343.9,893343.9,893343.9
Data Analyst,1170.0,9065.4,8302.5,129.8,4352.5,6765.4,10705.6,81318.9
Data Engineer,948.0,14768.8,15186.7,813.2,6245.4,10567.1,17276.2,159865.2
Data Science Associate,1.0,14447.0,NaN,14447.0,14447.0,14447.0,14447.0,14447.0
Data Science Consultant,1.0,32057.6,NaN,32057.6,32057.6,32057.6,32057.6,32057.6
Data Scientist,2220.0,17739.5,20887.8,607.4,7200.0,12284.1,20245.6,230812.3
Data Scientist - Trainee,2.0,16064.5,12357.9,7326.1,11695.3,16064.5,20433.6,24802.8
Junior Data Scientist,22.0,10400.6,10355.1,730.1,5005.0,7316.6,12363.3,45817.2
Lead Data Scientist,7.0,26025.3,11456.0,18251.6,19115.9,20096.8,28388.8,48819.7
Machine Learning Associate,6.0,4013.2,929.8,3103.2,3367.9,3747.3,4437.2,5572.5
Machine Learning Consultant,2.0,8476.8,8823.4,2237.7,5357.3,8476.8,11596.4,14715.9
Machine Learning Engineer,689.0,12585.6,14310.4,259.5,4355.3,8513.9,14906.9,111567.1
Machine Learning Scientist,2.0,2041.4,1832.1,745.9,1393.7,2041.4,2689.2,3336.9
National Director,1.0,429503.4,NaN,429503.4,429503.4,429503.4,429503.4,429503.4
Senior Data Scientist,45.0,24649.9,15271.5,3889.1,14601.3,21705.7,29693.1,83169.3
Senior Machine Learning Engineer,10.0,20534.6,14039.0,2753.0,11130.0,16642.7,30467.8,46214.9

1. Data Analysts, Scientist and Engineers have wxtremely low minimal year incomes, which doesn't seems right at all. 

On the other hand I can imagine that some of those people are doing some kind of part time job \ freelance projects, or their actual position is trainee since most of them have reported only one salary

So let's say we'll remove all rows with less 1200 USD yearly income.

There are few people, who is getting paid way more, then others. Let's think about maximum values which is 81k USD per year for data Analyst and 159k USD per year for Data Engineers.

For me these values sounds pretty real, taking into account that those people might be senior-level developers and even in this data set their role is 'Manager'. So, I'll leave biggest values as they are.

In [86]:
# Drop rows with yearly salary less than  1200 and data analyst job title.
# ~ symbol inverts the boolean mask to select all rows where condititon is False 
df3 = df3[~((df3['Yearly_Salary'] < 1200) & (df3['Job_Title'] == 'Data Analyst'))]
df3 = df3[~((df3['Yearly_Salary'] < 1200) & (df3['Job_Title'] == 'Data Engineer'))]
df3 = df3[~((df3['Yearly_Salary'] < 1200) & (df3['Job_Title'] == 'Data Scientist'))]

<ul>
<li>If we want to correlate upon categories (ordinal or binary), we need to use factorize(). <b>Factorize the Role-column, and add the new column to the DataFrame.</b></li>
<ul>
<li><b>Note:</b> using <b>factorize()</b> for nominal categories (Job Title, Location, Company Name) doesn't work well, because the numbers do not have any numeric magnitude. In other words, these categories don't measure anything, they just group data, so numerical comparison / correlation doesn't mean anything statistically.</li>
</ul>
</ul>

In [87]:

# factorize Role level into numbers
label1, unique1 = pd.factorize(df3['Role'], sort=False)
df3['ManagerRole'] = label1

# produce the needed factorization for Role-column

<ul>
<li><b>Finally, check out the correlations. Does anything correlate with anything? Can we make any assumptions?</b></li>
<ul>
<li>Tip: When correlating against binary variables, sometimes the Spearman correlation might be more sensitive, in pandas:</li>
</ul>
</ul>

In [88]:
df3.corr(method="spearman")

                   Salaries_Reported  Yearly_Salary  ManagerRole
Salaries_Reported                1.0           -0.1         -0.3
Yearly_Salary                   -0.1            1.0          0.4
ManagerRole                     -0.3            0.4          1.0

In this particular data set correlation between salary and role is quite weak.
But I believe that if we improve data and get more cleaner information - the correlation could grow stronger as well.

<b>Smaller extra tasks</b><br><br>
<ul>
<li>Did you get any ideas how this data could be improved? Do we need some particular new data or some other operations on the data? Should we filter something out based on some other column?<br><br><b>Provide arguments for your answers in code comments.</b><br><br> </li>
<ul>
<li>Note: There are many good possible answers here!</li>
<li>Tip: How about replacing the "Salaries Reported" column with actual rows based on that number? Try doing this with the data!</li>
<li>Remember: This data only represents data engineering salaries based on selected Indian cities.
The world is a vast place :)
</li>
</ul>
</ul>

1. In order to get clearer view on yearly salary we should also know what kind of job does person do. There should be column saying if it is part-time \ full-time \ freelance or whatever else kind of job.
2. We should know when the person have started working. It could be that now in our data we have some of people who got their job for example in december and in the end of the year they've reported one month salary as year salary.
3. Replacing "Salaries Reported" with actual rows could be very usefull since we could see if there any actual salary grow.
4. We could get rid of index column since it doesn't really matter.

In [89]:
# code for the smaller extra tasks


<h2><b>Advanced extra tasks for extra points (varying challenges, some require Googling):</b></h2>

<ul>
<li><b>1. Data merge is a useful tool when you have multiple files of data that have the exact same structure.</b><br><br>Download the two csv-files from Moodle (videogames1.csv, videogames2.csv), and combine them into one Data Frame. Lastly, save the Data Frame into a new csv-file => combined.csv.</li>
</ul>

In [90]:
# code for the advanced extra task
games1_df = pd.read_csv('videogames1.csv')
games2_df = pd.read_csv('videogames2.csv')
combined = games1_df.merge(games2_df, how='outer')
combined.to_csv('combined.csv')

<ul>
<li><b>2. Functions and lambdas allow us to extend the operations we wish to do to columns and rows in pandas. </b><br><br>For example, the built-in functions may not be enough in all cases. Use the data of exercise 1 (loans.csv), and create a new column called "Income Group" that holds a text value. <br><br>Create either a function or a lambda, that determines the True or False –value based on the Annual Income –column. Use the following table to create the values:</li>
</ul>

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_2/es2_3.png"/>

<li>After creating the function/lambda, you can use it by using pandas' .apply() –function.<br><br></li>

<li>Finally, get the amount of rows grouped by each of the new Income Group –field values and print them out.</li>

In [97]:
# code for the advanced extra task
def income_group(row):
    income = row['Annual_Income']
    if income <= 25000:
        inc_group = '$25k or less'
    elif 25000 < income < 50000:
        inc_group = '$25k - $50k'
    elif 50000 < income < 100000:
        inc_group = '$50k - $100k'
    elif 100000 < income < 200000:
        inc_group = '$100k - $200k'
    elif income > 200000:
        inc_group = '$200k+'
    return inc_group
df['Income_Group'] = df.apply(income_group, axis=1)

In [98]:
df.groupby('Income_Group').count()

,Loan_ID,Loan_Status,Current_Loan_Amount,Term,Credit_Score,Annual_Income,Years_in_current_job,Home_Ownership,Purpose,Monthly_Debt,Years_of_Credit_History,Months_since_last_delinquent,Number_of_Open_Accounts,Number_of_Credit_Problems,Current_Credit_Balance,Maximum_Open_Credit,Bankruptcies,Tax_Liens,Actuall_Annual_Income
Income_Group,,,,,,,,,,,,,,,,,,,
$100k - $200k,86,86,86,86,86,86,44,86,86,86,86,24,86,86,86,86,86,86,86
$200k+,88427,88427,88427,88427,69273,88427,84675,88427,88427,88427,88427,41703,88427,88427,88427,88425,88251,88418,88427
$50k - $100k,3,3,3,3,3,3,3,3,3,3,3,1,3,3,3,3,2,3,3

<ul>
<li><b>3.	Normalization allows us to convert the values of numeric columns to be between 0 and 1.</b> This is helpful when two different numbers seem to follow the same trend, but have completely different value ranges. For example, gold and silver prices tend to follow similar patterns, but their market worth is quite different. By using normalization, we can compare these trends more easily. <br>

Get historical prices of both gold and silver, and compare them without and with normalization. You can plot the prices by using df.plot() –function. Check the dataset in list in Moodle for some alternatives for gold and silver prices.
</li>
</ul>
<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_2/es2_4.png" />

<ul>
<li><b>4.	Create an account to kaggle.com, and find any dataset that interests you. </b><br>

There's a list of possibly interesting datasets listed in Moodle as well.
<br><br>
<b>Try to find interesting features in data, in particular:</b>
</li>
<ul>
<li>Clean up data first (rows with too many NaN –values), values that are way too big or small, insignificant columns etc.)</li>
<li>You can create new columns as well if it seems suitable! (either by using functions or other means)</li>
<li>Interesting correlations (.corr() –function) and other interesting features in the data. Is something surprising in the data?</li>
<li><b>Note: </b>There are many ways on how to approach this exercise.</li>
</ul>
</ul>

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_2/es2_5.png" />

In [ ]:
# do any Kaggle.com -related extra tasks in their own Jupyter notebooks for easier coding